def z1():
    countries = {"Россия": "Москва", "Иордания": "Амман", "Турция": "Анкара", "Казахстан": "Астана", "Таиланд": "Бангкок", "Китай": "Пекин", "Грузия": "Тбилиси"}
    print(countries)
    k = "Иордания"
    capital = countries.get(k)
    print(capital)
    c = sorted(countries.items(), key=lambda item: item[1])
    print(c)
z1()

def z2():
    slovo = input("Введите Ваше слово:")
    m0 = set(slovo)
    m1 = {"А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"}
    m2 = {"Д", "К", "Л", "М", "П", "У"}
    m3 = {"Б", "Г", "Ё", "Ь", "Я"}
    m4 = {"Й", "Ы"}
    m5 = {"Ж", "З", "Х", "Ц", "Ч"}
    m6 = {"Ш", "Э", "Ю"}
    m7 = {"Ф", "Щ", "Ъ"}
    count = 0
    if m0 & m1:
        count =+ 1

z2()

